print("andria")

movie = ("avatar")

#debugging - შეცდომის გასწორება

#შედგება 3 ეტაპისგან
#1. დაწერა
#2. გაშვება
#3. შეცდომის გასწორება

# syntax - კოდის წერის წესი
# () - ფრჩხილები 
# ( - გამხსენლი ფხრჩილი
# ) - დამხურავი ფხრჩილი
# "" - ბრჭყალები


# string - ნებისმიერ რამ რაც ბრჭყალებში წერია 
# integer - ნებისმიერი მთელი რიცხვი 
# float - ნებიმიერი ათწილადი რიცხვი, ანუ მარტივად რომ ვთქვათ წერტილიანი რიცხვი


# - ჰეშთეგი 
# - სიმბოლოს ვიყენებთ როცა კომენტარის დაწერა გვინდა Python - ში
# კომენტარებს ადამიანების გარდა ვერაფერი კითხულობს.


# error - შეცდომა
# variable - ცვლადი

# debugging - არის კოდში არსებული შეცდომების გასწორება.