# 1) შედარების ოპერატორები ადარებს  რიცხვების ერთმანეთთან  
#  >- მეტია
#  <- ნაკლებია 
#  == - ტოლია 
#  != - არ 
#  >= - მეტია ან ტოლია 
#  <= - ნაკლებია ან ტოლია


# true and false - გამოიტანს false ს 
# true or false  - გამოიტანს true ს




# algorithm  - არის ნაბიჯ-ნაბიჯ ინსტრუქცია
# pseudocode - არის პროგრამირებასთან მიახლოებული, რომელიც გვეხმარება ალგორითმის წარმოდგენაში 
# flowchart  - არის ალგორითმის ვიზუალური წარმოდგენა 
# sequencin  - არის თანმიმდევრობა
# iteration  - არის გამეორება
# selection  - არის შერჩევადობა