# 1)
#algorithm - არის ნაბიჯ-ნაბიჯ ინსტრუქციის მიცემა
#pseudocode - გვეხმარება ალგორითმის წარმოდგენაში. ის მიახლოებულია პროგრამირებასთან 
#flowchart -  არის ალგორითმის ვისუალური წარმოდგენა
#sequencin -  ნიშნავს თანმიმდევრობას
#iteration -  ნიშნავს გამეორებას
#selection - ნიშნავს  შერჩევადობას
# 2) 
# control flow შედგება 3 ნაწილისგან. ესენია sequence , selection  და iteration 
# 3)
# სულ ჩვენ სამის ალგორითმის წარმოდგენის გზა გვაქვს. ესენია სიტყვიერი , გრაფიკული და პროგრამული წარმოდგენა
# 4) 
# ალგორითმი არის ნაბიჯ ნაბიჯ ინსტრუქციის მიცემა. მაგ: მიკროტალღურში კერძის გაცხელება - ავიღებთ ჩვენ სასურველ საკვებს , ვათავსებთ ღუმელში  და დავაჭერთ ჩართვის ღილაკს
