# <!-- Web Developent - ერეთი პროგრამირების ერთ-ერთი განხრა, ნიშნავს საიტების აწყობას -->
# <!-- Frontend - საიტების წინა მხარე, ანუ რასაც მომხმარებელი ხედავს საიტზე -->
# <!-- Backend - საიტის უკანა მხარე, ანუ რასაც მომხმარებელი ვერ ხედავს საიტზრ-->
# <!-- html - HyperText Markup Language -->
# <!-- html - არ არის პროგრამირების ენა, გვეხმარება საიტების სტრუქტურის აგებაში -->
# <!-- css - გვეხმარება საიტის გალამაზებაში -->
# <!-- javascript - გამოიყენება საიტზე ფუნქციონალის დამატებაზე, ანუ ჩვენი საიტი დინამიკური რომ იყოს-->


#დინამიკური - ნიშნავს ცვლაებადს
 
#<!--  --> - html კომენტარი

# <!-- / - slash -->
# <!-- container tag - არის თეგი როცა მას აქვს გამხსენი თეგი და დამხურავი თეგი -->